{"./files\\cybersecurity-EN\\cybersecurity-EN.docx": {"EN": {"filename": "cybersecurity-EN.docx", "path": "", "text": "An introduction to the cyber threat environment\n\nFrom: Canadian Centre for Cyber Security\n\nAlternate format: Introduction to the Cyber Threat Environment (PDF, 2.45 MB)\n\nCommunications Security Establishment\nOttawa, ON K1J 8K6\n\nISBN: 978-0-660-45950-9\nCat: D96-9/2022E-PDF\n\n \n\nTable of contents\n\n \n\nAbout this document\n\n\n\nThis document describes common concepts relevant to discussions about cyber threat  activity in the Canadian context and acts as a point of reference for Canadian Centre for Cyber Security  (Cyber Centre) publications. This introductory document provides baseline knowledge about the cyber threat environment, including cyber threat actors and their motivations, sophistication, techniques, tools, and the cyber threat surface.\n\nPlease see the Cyber Centre Glossary for additional terminology and the Cyber Centre guidance page for more discussions on the cyber threat environment.\n\n \n\nCyber threat\n\nA cyber threat is an activity intended to compromise  the security of an information system by altering the availability , integrity , or confidentiality  of a system or the information it contains, or to disrupt digital life in general.\n\nThe cyber threat environment is the online space where cyber threat actors conduct malicious cyber threat activity. It includes the networks, devices, and processes that are connected to the Internet and can be targeted by cyber threat actors, as well as the methods threat actors use to target those systems.\n\n \n\nCyber threat actors\n\nCyber threat actors are groups or individuals who, with malicious intent, aim to exploit weaknesses in an information system or exploit its operators to gain unauthorized access to or otherwise affect victims’ data, devices, systems, and networks, including the authenticity of the information that flows to and from them. The globalized nature of the Internet allows threat actors to be physically located anywhere in the world and still affect the security of information systems in Canada.\n\nTypes of cyber threat actors and their motivations\n\nCyber threat actors can be categorized by their motivations and, to a degree, by their sophistication. Threat actors value access to devices and networks for different reasons, such as siphoning processing power, exfiltrating or manipulating information, degrading the network’s performance and extorting the owner. Some threat actors conduct threat activity against specific individuals or organizations, while others opportunistically target vulnerable systems. In general, each category of cyber threat actor has a primary motivation.\n\nFigure 1: Cyber threat actors\n\nLong description - Cyber threat actors and their motivation\n\n \n\nSophistication\n\nCyber threat actors are not equal in terms of capability and sophistication. They have a range of resources, training, and support for their activities. Cyber threat actors may operate on their own or as part of a larger organization (i.e., a nation-state intelligence program or organized crime group). Sometimes, sophisticated actors use readily available tools and techniques because they can still be effective for a given task and/or make it difficult for defenders to attribute the activity—for example, by leveraging the commercial security tools used by security researchers.\n\nAdvanced persistent threats (APT) refer to threat actors in the top tier of sophistication and skill. APTs are capable of using advanced techniques to conduct complex and protracted campaigns in the pursuit of their goals. This designator is usually reserved for nation-states or very proficient organized crime groups.\n\nState-sponsored cyber threat actors operating on behalf of nation-states primarily use cyber threat activity to advance their geopolitical objectives. They are frequently the most sophisticated threat actors, with dedicated resources and personnel, and extensive planning and coordination. Nation-states without developed cyber programs can use commercial cyber tools and the growing global pool of talent to enable sophisticated cyber threat activity. Some nation-states also have operational relationships with private sector entities and organized criminals.\n\nThe activities of state-sponsored cyber threat actors may include espionage against governments, organizations, and individuals; prepositioning on or disrupting critical systems; influencing and shaping public discourse; or building networks of compromised devices to enable further cyber threat activity. State-sponsored cyber threat actors may also pursue financially motivated threat activity.\n\nCybercriminals are primarily financially motivated and vary widely in sophistication. Organized crime groups often have planning and support functions in addition to specialized technical capabilities that can affect a large number of victims. Illegal online markets for cyber tools and services have made cybercrime more accessible and allowed cybercriminals to conduct more complex and sophisticated campaigns.\n\nHacktivists carry out ideologically motivated cyber threat activity and are generally lower sophistication than state-sponsored cyber threat actors or organized cybercriminals. These actors, alongside terrorist groups and thrill-seekers, often rely on widely available tools that require little technical skill to deploy. Their actions often have no lasting effect on their targets beyond reputation, however, at times these actors have been able to inflict physical and financial damages on their targets.\n\nInsider threats are individuals working within their organization who are particularly dangerous because of their access to internal networks that are protected by security perimeters. Insider threats are often disgruntled employees, and may be associated with any of the other listed types of threat actors.\n\nCommercial cyber tools\n\nCommercial cyber providers sell tools and services that allow clients to deliver malware , intercept communications, and steal information from target devices. Commercial cyber tools are often advertised as being for law enforcement, but not all providers discriminate in who they sell to. Cyber threat actors may leverage commercial cyber tools to increase the sophistication of their threat activity.\n\nTop of page \n\n \n\nCyber threat surface\n\nThe cyber threat surface refers to all information systems and services a cyber threat actor may exploit in trying to compromise an individual, organization, or network. It includes all Internet-exposed endpoints, including networks, personal computers, mobile devices, Internet of Things (IoT) devices, and servers, in addition to processes that communicate with or rely on information systems connected to the Internet. Individual threat surface is also informed by the amount of personal information shared with online vendors and services; the broader an individual shares their personal and financial details, the more vulnerable their information becomes to theft or exposure via a data breach. The larger the cyber threat surface of an individual, organization, or network, the more difficult it is to secure.\n\nThe number of endpoints connected to the Internet increases significantly every year, driven by increased deployment of Internet of Things (IoT) and industrial IoT (IIoT) devices.Footnote1 Connected consumer and medical devices such as home security systems, cars, and pacemakers are becoming more common, as is connected operational technology (OT), the hardware and software integrated into devices used to monitor and cause changes in the physical world.\n\nServices, devices, and data can all be targeted by cyber threat actors to gain initial access into an environment. Supply chains increasingly include digital information transfer in addition to the movement of physical goods. Since 2020, more organizations have adopted technologies such as cloud-based software, infrastructure, and platform “as-a-service” products to increase their efficiency in a hybrid work environment, with some employees working from home and others on site. Managed service arrangements often include elevated access for suppliers into their clients’ networks. The trust and information flow between organizations provides threat actors an indirect means of compromising their intended targets by first compromising a third-party.\n\n\n\nFigure 2: Endpoints\n\nAn endpoint is any device connected to a network, including personal computers, mobile devices, IoT devices, servers, and more.\n\n\n\nTop of page \n\n \n\nCyber threat targets, impacts, and activities\n\nThe targets of cyber threat activity\n\n\n\nCyber threat actors conduct malicious activity against anything connected to or residing on the Internet, including devices, information, financial resources, opinions, and reputations:\n\nDevices includes connected technology such as personal cell phones or computers, servers, and the operational technology that controls industrial processes. Once compromised, devices can be used to facilitate further cyber threat activity.\n\nInformation includes intellectual property, other sensitive business information, and personal information. This could also include valuable financial information such as banking details or logins.\n\nFinancial resources include assets such as fiat currency and digital assets, including cryptocurrency. Cyber threat actors often target Canadian individuals with fraud and scams aimed at convincing victims to send money to a threat actor to avoid a punishment or receive a fictional reward. Cyber threat activity aimed at financial institutions and systems may intend to steal much larger sums.\n\nOpinions can be influenced and reputations damaged through online influence activities using misinformation, disinformation, or malinformation. Threat actors can target individuals or social discourse more broadly, by influencing specific events such as elections or conducting persistent influence campaigns to promote narratives favourable to their geopolitical objectives.\n\nThe impacts of cyber threat activity\n\nImpacts to Canadians’ privacy\n\nCanadians put significant amounts of personal information online and depend on Internet-connected devices for communication, finances, entertainment, comfort, and safety. As this information moves online, it becomes vulnerable to cyber threat actors. Cyber threat actors also steal financial, medical, and other personal information to sell online or use in cybercrimes. Large corporate data breaches impact millions of customers and reveal personal information that can be used in follow-on crimes.\n\nImpacts to Canadians’ financial security\n\nWhen threat actors obtain Canadians’ login credentials, credit card details, and other personal information they can use this information to steal money, commit fraud, or sell it on cybercrime marketplaces. Cyber threat actors also target point-of-sale (POS) systems used by businesses by installing malware that can steal customer information, interfere with business operations, make fraudulent purchases, manipulate pricing, and cause other forms of disruption.\n\nCanadians are targeted by online fraud schemes. Cyber threat actors keep scams relevant and appealing by associating their cyber fraud operations with current events. Elections, tax season, and trending news stories have all been used as a backdrop for cybercrime.\n\nImpacts to Canada’s economic health\n\nCyber threat activity results in unwanted expenses for organizations, including the costs of ransoms or stolen funds, losses due to the disruption of operations, the price of securing and insuring networks, reputational damage and related loss of customers, and theft of intellectual property  or sensitive information. These costs are a drain on organizations’ finite resources and decrease their competitiveness. Taken together, they are also a drain on the Canadian economy.\n\nCyber threat actors target Canadian businesses with the intent of stealing valuable business information. The theft of this information can have both short- and long-term financial consequences for the victims, including impacts to global competitiveness and reputational damage.\n\nImpacts to Canadians’ trust\n\nBy spreading false and potentially harmful information, cyber threat actors pollute the online information space making it difficult for Canadians to separate truth from falsehoods. This can influence civil discourse, influence policymakers’ choices, and impact the reputations of politicians and leaders.\n\nCyber threat actors exploit trusted relationships between organizations by targeting online and in-person payment systems, supply chain vulnerabilities, or by taking advantage of the privileged access held by managed service providers—companies that provide information technology (IT) services and maintain the networks of their clients.\n\nImpacts to Canadians’ safety and security\n\nWhen cyber threat actors target physical processes in industry, or critical services connected to the Internet such as those in healthcare or transportation, disruptions can result in impacts to Canadians’ safety and security. For individuals, there is a risk that cyber threat activity against home and personal IoT devices, including medical devices such as pacemakers, can impact physical safety.\n\nStalkers and abusive partners can take advantage of vulnerabilities in personal IoT devices to steal information collected by fitness trackers and smart home technologies to identify and locate victims, or overtly control a victim’s devices to intimidate them.\n\n\n\nTop of page \n\nHow cyber threat actors operate\n\nCyber threat actors pursue their objectives by exploiting technical vulnerabilities, using social engineering , and by creating, disseminating, or amplifying false or misleading content online to influence individuals’ behaviour and beliefs.\n\nVulnerability exploitation involves taking advantage of weaknesses or flaws in the design, implementation, operation, or management of an IT system, device, or service, collectively referred to as vulnerabilities. Threat actors use exploits to take advantage of vulnerabilities, and deploy payloads that allow them to access, control, destroy, or enable further malicious activity on a victim’s system. Threat actors can use tools that directly exploit specific technical vulnerabilities, and sophisticated actors may invest resources in attempting to discover new, previously unknown vulnerabilities, referred to as zero-days, in target systems. While zero-days have the advantage of being unknown to the owner of the IT system or software, cyber threat actors target known vulnerabilities as well, taking advantage of weak security protocols and unpatched systems.\n\nSocial engineering involves taking advantage of the people using the IT by exploiting human traits such as carelessness and trust. Threat actors use social engineering to trick individuals into providing sensitive information or inadvertently allowing access to a system, network, or device. Social engineering is an extremely common tactic in cyber threat activity today. For example, business email compromise (BEC) is a common and costly social engineering scheme, where threat actors impersonate executives or trusted third parties to trick victims into directly transferring funds. Social engineering is also often used in combination with vulnerability  exploitation. For example, threat actors will create phishing  and spear-phishing emails with malicious links or attachments – when people interact with those links and attachments, it activates exploits that provide the threat actor access into the victim’s system.\n\nForeign cyber threat actors can also manipulate social media and legitimate advertising and information-sharing tools to conduct online foreign influence campaigns that seek to impact domestic events such as elections, censuses, or public health campaigns, as well as public discourse more broadly. Online foreign influence occurs when foreign cyber threat actors covertly create, disseminate, or amplify misinformation, disinformation, or malinformation to influence the beliefs or behaviours of the citizens of another state. With a thorough understanding of how traditional media and social media work—and how individuals consume information—cyber threat actors can promote their message to broad target audiences at a relatively low cost. They can do this by masquerading as legitimate information providers, hijacking social media accounts, or creating websites and new accounts. Threat actors can also leverage technology to create synthetic content including text, images, or videos, to promote their messages or create distrust.\n\nIdentifying cyber threat activity\n\n\n\nAttribution is the act of accurately determining the threat actor responsible for a particular set of activities. Successful attribution of a cyber threat actor is important for several reasons, including network defence, law enforcement, deterrence, and foreign relations. However, attribution can be difficult as many cyber threat actors attempt to evade attribution through obfuscating their activities.\n\nObfuscation refers to the tools and techniques that threat actors use to hide their identities, goals, techniques, and even their victims. To avoid leaving clues that defenders could use to attribute the activity, threat actors can use tools and techniques that covertly send information over the Internet.\n\nSophisticated threat actors may also conduct false flag operations, whereby an actor mimics the known activities of other actors with the hope of causing defenders to falsely attribute the activity to someone else. For example, a nation-state could use a tool believed to be used extensively by cybercriminals or other nation-states in the hopes that it will be attributed to them.\n\nThe ability of cyber threat actors to successfully obfuscate their actions varies according to their level of sophistication and motivation. In general, nation-states and competent cybercriminals are more adept at obfuscation than other threat actors.\n\nTop of page \n\n \n\nAppendix: Glossary\n\nThe following is a non-exhaustive list of common tools and techniques that are used by threat actors. For simplicity, they are listed alphabetically and are not ranked according to frequency or impact.\n\nBackdoor\n\nA backdoor is a point of entry into a user’s system or computer that bypasses traditional access and authentication  measures. Once threat actors have this remote access, they can steal information, install malware, or control the device’s processes and procedures. Backdoors can be a product of malware or other malicious cyber activity, but are also often deliberately and non-maliciously created for troubleshooting, software updates, or system maintenance. Threat actors can use these legitimate backdoors for malicious purposes.\n\n\n\nBots and botnets\n\nA bot, also known as a zombie, is an Internet-connected device (e.g., computers, mobile, and IoT devices) that is infected with malware without the owner’s awareness and is remotely controlled by a threat actor to perform a specific malicious task. A botnet is a grouping of these compromised devices that are coordinated by a threat actor. Botnets typically expand by scanning the online environment and finding vulnerable devices that can provide computing power and additional capacity. Botnets are used for a multitude of purposes, such as to conduct distributed denial of service (DDoS ), spread ransomware  and malware, conduct ad fraud campaigns, send spam, divert traffic, steal data, and manipulate, amplify, and/or suppress social media and web platform content in order to impact public discourse.\n\n\n\n(Distributed) Denial of service\n\nDenial of service (DoS) refers to any activity that makes a service (e.g., website, server, network, IoT device) unavailable for use by legitimate users, or that delays system operations and functions.\n\nFlooding attacks\n\nFlooding attacks are the most common form of DoS , where the threat actor repeatedly sends requests to connect to the target server but does not complete the connections. These incomplete connections occupy and consume all available server resources. As a result, the server cannot respond to legitimate traffic and connection attempts.\n\n\n\nCrash attacks\n\nCrash attacks are less common than flooding attacks, and refer to when threat actors exploit a vulnerability to crash a system, thus denying access to it.\n\nDistributed denial of service (DDoS)\n\nA distributed denial of service attack, or DDoS, is a DoS attack that originates from several machines at once. These machines can be controlled by a group of threat actors working together or be part of a botnet acting under the direction of a single threat actor. DDoS are more powerful and make it more difficult to identify the true source of the attack.\n\nFigure 3: Distributed denial of service\n\nLong description - Distributed denial of service\n\n\n\nExploits and exploit kits\n\nAn exploit is malicious code that takes advantage of an unpatched vulnerability. An exploit kit is a collection of multiple exploits that affect unsecure software applications. Each exploit kit is customized to search for specific vulnerabilities and execute the corresponding exploit for the vulnerability it finds. If a user visits a website hosting an exploit kit, the exploit kit will test its repository of exploits against the software applications on the user’s device and deploy the exploit that fits the user’s vulnerability.\n\nCode injection\n\nCode injection is when threat actors introduce malicious code into a computer program by taking advantage of a flaw in a program’s functionality instructions or in the way it interprets data input. Two common code injection  techniques are cross-site scripting (XSS) and Structured Query Language (SQL) injection.\n\nXSS is a code injection method whereby a threat actor injects and executes malicious code within a web application by bypassing the mechanisms that validate input. The malicious code is executed in the browser of users accessing the exploited web application. Code injected by XSS may either be a one-time execution or used to enable further malicious activity.\n\nSQL injection retrieves or modifies the contents of an SQL database by entering code into web forms that are meant to receive input for or query SQL databases. These databases may hold personally identifiable or other sensitive information.\n\nZero-day exploits\n\nA zero-day vulnerability is a vulnerability that is not yet known by the vendor, and therefore has not been mitigated by a patch. A zero-day exploit is an attack directed at a zero-day vulnerability. Once a patch is developed, the vulnerability is no longer considered a zero-day.\n\n\n\nLiving off the land\n\nLiving-off-the-land is when threat actors use only the tools available through the victim systems’ legitimate processes to conduct malicious cyber activity, rather than deploying malware. Cyber threat actors use pre-existing system tools to blend into the normal operations of a victims’ device or network and avoid detection .\n\n\n\n \n\nTop of page \n\nMalware\n\nMalware, short for “malicious software”, refers to any software or code designed to infiltrate or damage a computer system. “Payload” refers to the actions malicious software takes once inside a victim’s system or network (e.g., ransomware encrypting files or the installation of system backdoors that enable remote access).\n\nAdware\n\nAdware is short for “advertising software”. Adware may infect a computer by being downloaded as part of another program or through web-based drive-by exploits. Its main objective is to generate revenue by delivering tailored online advertisements. Browser-based and application-based adware tracks and gathers user and device information, including location data and browsing history. Adware can lead to exploitation of security settings, users, and systems.\n\nBeacon\n\nBeacons are signals sent by malware that attempt to connect to a cyber threat actor’s command and control infrastructure once it has successfully infiltrated the target environment. Beacons let the threat actor know that they have successfully compromised the system and allows them to send additional commands to the malware.\n\nCryptojacker\n\nCryptojacking is when a threat actor covertly exploits a victim’s device (e.g., computers, mobile, and IoT devices) for the unauthorized mining of cryptocurrency. In order to increase efficiency (e.g., revenue) a threat actor can leverage a botnet of compromised devices. Such malware is typically delivered by visiting a compromised website, installing an application, or through phishing. Cryptomining or cryptocurrency mining is when software programs leverage computing resources to generate or “mine” a cryptocurrency, an activity that rewards the miner with a small fraction of the mined cryptocurrency as a fee for the mining service.\n\nRansomware\n\nRansomware is malicious software that restricts access to or operation of a computer or device, restoring it following payment. Threat actors often accomplish this through encryption , although they may also employ any number of methods of extortion, such as DDoS, threatening partners and clients, and/or threatening to release sensitive information. Ransomware is typically installed using a trojan  or a worm  deployed via phishing or by visiting a compromised website.\n\nSome cybercriminals engage in big game hunting (BGH) ransomware campaigns, where they focus their activities against large organizations like critical infrastructure  providers, governments, and large enterprises, that cannot tolerate sustained disruptions to their networks and are willing to pay large ransoms to quickly restore their operations.\n\nRootkit\n\nA rootkit is a malicious application designed to provide a threat actor with “root” or administrative privileged access to software and systems on a user’s device. A rootkit provides full control, including the ability to modify software used to detect malware.\n\nSpyware\n\nSpyware is malicious software used to track a user’s digital actions and information with or without the user’s knowledge or consent. Spyware can be used for many activities, including keystroke logging, accessing the microphone and webcam, monitoring user activity and surfing habits, and capturing usernames and passwords. Spyware used to facilitate intimate partner violence, abuse, or harassment is referred to as stalkerware.\n\nTrojan\n\n\n\nA trojan is a malicious program disguised as or embedded within legitimate software.\n\nVirus\n\nA virus is an executable and replicable program that inserts its own code into legitimate programs with the objective of damaging the host computer (i.e., deleting files and programs, corrupting storage and operating systems).\n\nWiper\n\nA wiper is malware designed to completely wipe the hard drive of infected devices. Wipers may pose as ransomware to obfuscate the intent of the malware and make attribution more difficult.\n\nWorm\n\nA worm is a computer program that independently self- replicates and spreads to other computers to drain a system’s resources. Just like a virus , a worm can propagate code that can damage its host (e.g. deleting files, sending documents via email, or taking up bandwidth).\n\n\n\nTop of page \n\n \n\nOnline foreign influence activities\n\nOnline foreign influence activities (OFIA) are a common tool for adversaries to further their core interests, including national security, economic prosperity, and ideological goals. Online influence campaigns can try to impact civil discourse, influence policy makers’ choices, exacerbate friction in democratic societies, and damage the reputation of public figures such as politicians. OFIA often exploits misinformation, disinformation, and malinformation.\n\nMisinformation\n\nMisinformation refers to unintentionally false information that is not intended to cause harm.\n\nDisinformation\n\nDisinformation refers to intentionally false information that is intended to manipulate, cause damage, or guide people, organizations, and countries in the wrong direction.\n\nMalinformation\n\nMalinformation refers to information that stems from the truth but is often exaggerated in a way that misleads and causes potential harm.\n\n\n\nPassword cracking\n\nPassword cracking refers to techniques that allow cyber threat actors to directly access an account by guessing or decrypting the password.\n\nBrute force\n\nBrute force cracking uses an exhaustive number of randomly generated passwords to attempt to guess the correct password and obtain access to the account. Brute force password cracking is the least efficient method, especially against complex passwords.\n\nCredential stuffing\n\nCredential stuffing is when lists of compromised username and password pairs are used to gain unauthorized access to online accounts. Cyber threat actors use these lists to conduct large-scale automated login requests, hoping that one of the compromised pairs will match an existing account on the site and give them access.\n\nDictionary attack\n\nDictionary attacks take advantage of comprehensive lists of words and commonly used passwords, often including common misspelling of words and various permutations that account for password complexity requirements.\n\n\n\nPerson-in-the-middle\n\nPerson-in-the-middle (PITM) is a technique by which a threat actor intercepts a communication between two parties, such as a victim and a web server, without the victim’s knowledge. The victim is under the illusion that they are communicating directly and securely with a website. PITM enables threat actors to monitor communications, reroute traffic, alter information, deliver malware, and acquire personally identifiable or other sensitive information. PITM can be achieved via several techniques such as phishing, pharming, typo-squatting, Wi-Fi eavesdropping, and SSL hijacking.\n\nFigure 4: Person-in-the-middle\n\nLong description - Person-in-the-middle\n\n \n\nTop of page \n\nSSL hijacking\n\nSecure Sockets Layer (SSL) hijacking is a technique by which a threat actor intercepts and redirects an unsecure connection between a victim and a server trying to establish a secure connection. The threat actor is then able to provide a secure connection instead of the intended website, which enables them to intercept and compromise the communication without the victim’s knowledge (see person-in-the- middle above). SSL hijacking is not about breaking the security provided by SSL, but rather, it inserts a compromised bridge between the non-encrypted and encrypted part of a communication.\n\nWi-Fi eavesdropping\n\nWi-Fi eavesdropping is when a threat actor installs what looks like a legitimate Wi-Fi access point in a public area. Once users connect to such an access point, often referred to as a malicious hotspot or a rogue access point, they fall victim to person-in-the-middle (PITM). Alternatively, threat actors may be able to intercept unencrypted web traffic on unsecured public Wi-Fi networks. Such activity allows a threat actor to monitor communications and to acquire personally identifiable or other sensitive information.\n\n\n\nTop of page \n\nReconnaissance\n\nReconnaissance, or recon, refers to activities conducted by a threat actor to obtain information and identify vulnerabilities to facilitate future compromise(s). Opportunistic threat actors may scan the Internet for hosts with unsecured vulnerabilities and target them. When a target is selected, the threat actor may conduct additional research on their target including open-source searches on their business, employees, and infrastructure. More direct techniques include probing the target with malicious Internet traffic or using social engineering to extract information.\n\n\n\nSocial engineering\n\nSocial engineering is the practice of obtaining sensitive information by manipulating legitimate users, often using the telephone or Internet. Social engineering techniques may attempt to deceive the target into sending payment to an account controlled by the threat actor or collect information to enable further threat activity.\n\nPhishing\n\nPhishing is a common method by which threat actors disguise themselves as a trustworthy entity with the intent to lure a large number of recipients into providing information, such as login credentials, banking information, and other personally identifiable information. Phishing is an example of a social engineering technique and is mainly conducted through email spoofing and text messages. Users become victims when they open malicious attachments or click on embedded links.\n\nSpoofing\n\nSpoofing is the act of masking or forging a website, email address, or phone number to appear as if it originates from a trusted source. After receiving a phishing message, the victim can be enticed into giving away personal, financial, or other sensitive information or clicking on a link or attachment, which can infect a device with malware.\n\nSpear-phishing\n\nSpear-phishing occurs when a cyber threat actor sends a personally tailored phishing message to a more precisely selected set of recipients or even a single recipient. Spear-phishing relies on social engineering, using details that are believable to the victim as originating from a trusted source. Whaling refers to spear-phishing targeted at senior executives or other high-profile recipients with privileged access and authorities.\n\nBusiness email compromise (BEC)\n\nBusiness email compromise (BEC) is one of the most common and costly social engineering schemes targeting organizations. BEC involves emails designed to trick an employee in the target organization into directly transferring funds to cyber threat actors. To achieve this, cyber threat actors often impersonate high-level executives or trusted third parties.\n\nFigure 5: Phishing and spear-phishing\n\nLong description - Distributed denial of service\n\n\n\n \n\nTop of page \n\nWeb-based exploits\n\n\n\nWeb-based exploits aim to compromise users when they browse, or attempt to browse, to specific webpages. They function by compromising or impersonating a website that victims wish to visit, compromising the victim themselves, or exploiting vulnerabilities in the systems that direct users to the correct webpage.\n\nDrive-by exploit\n\nA drive-by exploit refers to malicious code that a cyber threat actor has placed on a website without the website host’s knowledge; the malicious code attempts to compromise the devices of any user who visits the website.\n\nFormjacking\n\nFormjacking is when cybercriminals inject malicious code into a webpage form, such as a payment page, to compromise it and steal credit card details and other information that is entered by users on these pages.\n\nPharming\n\nPharming is a technique used to redirect traffic from a legitimate website to a malicious one. This deception can be achieved by modifying the user’s system settings or by exploiting vulnerabilities in the domain name system (DNS) server software, which is responsible for resolving URLs into IP addresses. Contrary to typo-squatting (see below), where a user mistypes a website address and is redirected to an illegitimate website, pharming can redirect a user who properly types the URL. At a quick glance, the illegitimate website may appear to be the legitimate website and can be used to deliver malware and acquire personally identifiable or other sensitive information.\n\nTypo-squatting\n\nTypo-squatting is a technique by which a threat actor registers domain names that have very similar spelling to and can be easily confused with a legitimate domain address. Typo-squatting is also known as URL hijacking and enables a threat actor to redirect a user who incorrectly typed a website address to an alternative look-alike domain under the actor’s control. The new domain can then deliver malware and acquire personally identifiable or other sensitive information. Luring a victim to a hijacked URL can also be achieved through phishing techniques.\n\nWatering hole\n\nA watering hole is a website compromised with an exploit and frequented by individuals specifically targeted by a cyber threat actor."}, "FR": {"filename": "cybersecurity-FR.docx", "path": "", "text": "Introduction à l'environnement de cybermenaces\n\nDe : Centre canadien pour la cybersécurité\n\nAlternate format: Introduction à l’environnement de cybermenace (PDF, 2.51 Mo)\n\nCentre de la sécurité des télécommunications\nOttawa, ON K1J 8K6\n\nISBN: 978-0-660-45951-6\nCat: D96-9/2022F-PDF\n\n \n\nTable des matières\n\n \n\nÀ propos du présent document\n\n\n\nLe présent document décrit les concepts pertinents aux discussions relatives aux activités de cybermenace  dans le contexte canadien et sert de point de référence aux publications du Centre canadien pour la cybersécurité  (Centre pour la cybersécurité). Il transmet des connaissances de base sur l’environnement de cybermenace, notamment sur les auteurs de cybermenace et leurs motivations, le degré de sophistication, les techniques, les outils et l’exposition aux cybermenaces.\n\nPrière de consulter le glossaire du Centre pour la cybersécurité pour trouver des termes additionnels, ainsi que sa page de conseils pour de plus amples discussions sur l’environnement de cybermenace.\n\n \n\nCybermenace\n\nUne cybermenace est une activité qui vise à compromettre la sécurité d’un système d’information en altérant la disponibilité , l’intégrité  ou la confidentialité  d’un système ou de l’information qu’il contient, ou à perturber le monde numérique en général.\n\nPar environnement de cybermenace, on entend l’espace virtuel où les auteurs de cybermenace mènent des activités malveillantes. Il comprend les réseaux, les dispositifs et les processus qui sont connectés à Internet et qui peuvent être la cible d’auteurs de cybermenace, ainsi que les méthodes utilisées par ces auteurs pour atteindre les systèmes.\n\n \n\nAuteurs de cybermenace\n\nLes auteurs de cybermenace sont des groupes ou des personnes qui, dans un but malveillant, cherchent à exploiter les lacunes dans un système d’information, ou à tirer avantage des exploitants de ce système pour obtenir un accès non autorisé ou encore porter préjudice  aux données, aux dispositifs, aux systèmes et aux réseaux des victimes, y compris l’authenticité de l’information vers ces systèmes et en provenance de ceux-ci. L’universalisation d’Internet fait en sorte que les auteurs de menace peuvent se trouver n’importe où dans le monde et toujours compromettre la sécurité des systèmes d’information au Canada.\n\nTypes d’auteurs de cybermenace et leurs motivations\n\nOn peut catégoriser les auteurs de cybermenace selon leur motivation et, dans une certaine mesure, selon leur degré de sophistication sur le plan technique. Les auteurs de menace cherchent à obtenir l’accès aux dispositifs et aux réseaux pour différentes raisons, par exemple, pour le siphonnement de la puissance de traitement, l’exfiltration  ou la manipulation de l’information, la dégradation du rendement d’un réseau et l’extorsion à l’endroit du propriétaire. Certains auteurs de menace mènent des activités de cybermenace contre des personnes ou des organisations précises, alors que d’autres agissent de façon opportuniste pour cibler des systèmes vulnérables. Or, chaque catégorie d’auteurs de cybermenace est animée par une motivation principale.\n\nFigure 1 : Auteurs de cybermenace\n\nDescription détaillée - Auteurs de cybermenaces et motivation\n\n \n\nDegré de sophistication sur le plan technique\n\nLes auteurs de cybermenace n’ont pas les mêmes capacités et le même degré de sophistication sur le plan technique. Ils tirent parti d’un large éventail de ressources, de formations et de soutien pour mener leurs activités. Ils peuvent agir seuls ou faire partie d’une organisation plus large (p. ex. le programme de renseignement d’un État-nation ou un groupe du crime organisé). Les auteurs de menace disposant de moyens sophistiqués ont parfois recours à des outils et à des techniques facilement accessibles parce que ceux-ci sont quand même efficaces pour une tâche donnée ou qu’ils rendent le processus d’attribution d’une activité plus difficile, par exemple, en tirant parti des outils de sécurité commerciaux utilisés par les chercheurs en sécurité.\n\nLes auteurs de menaces persistantes avancées (MPA) sont des auteurs de cybermenace utilisant des méthodes grandement sophistiquées et possédant un niveau de compétence très élevé. Ils sont en mesure d’utiliser des techniques avancées pour mener des campagnes complexes et prolongées afin de réaliser leurs objectifs stratégiques. Cette dénomination est généralement réservée à des États-nations et à des groupes du crime organisé très compétents.\n\nLes auteurs de cybermenace parrainés par des États travaillent pour le compte d’un État-nation précis et ont recours à des activités de cybermenace principalement pour mener à bien leurs objectifs géopolitiques. Ils possèdent souvent les moyens les plus sophistiqués en raison des ressources et du personnel à leur disposition, et des efforts de planification et de coordination qu’ils peuvent déployer. Les États-nations qui n’ont pas développé de cyberprogrammes peuvent avoir recours à des cyberoutils commerciaux et à un bassin mondial de talents en pleine croissance pour assurer la mise en œuvre d’activités de cybermenace sophistiquées. Certains États-nations entretiennent également des relations opérationnelles avec des membres du crime organisé.\n\nParmi les activités des auteurs de cybermenace parrainés par des États, notons l’espionnage contre des gouvernements, des organisations et des personnes; le prépositionnement dans les systèmes essentiels ou la perturbation de ceux-ci; ou l’établissement de réseaux d’appareils compromis pour permettre de poursuivre les activités de cybermenace. Les auteurs de cybermenace parrainés par des États peuvent aussi se livrer à des activités motivées par l’appât du gain.\n\nLes cybercriminels sont principalement motivés par le gain financier et le degré de sophistication de leurs méthodes varie beaucoup. Les groupes du crime organisé peuvent souvent disposer de fonctions de planification et de soutien, ainsi que de capacités techniques spécialisées susceptibles de faire de nombreuses victimes. Les marchés en ligne servant à la vente d’outils et de services illicites ont rendu la cybercriminalité plus accessible et ont permis aux cybercriminels de mener des activités plus complexes et sophistiquées.\n\nLes activités de cybermenace des hacktivistes sont motivées par des considérations idéologiques et sont généralement moins sophistiquées que celles d’auteurs de cybermenace parrainés par des États ou de groupes du crime organisé. Ces auteurs, tout comme les groupes terroristes et les amateurs de sensations fortes, ont souvent recours à des outils accessibles à grande échelle qu’il est facile de déployer avec des compétences techniques limitées. Bien que leurs actions n’aient souvent aucune conséquence durable sur leurs cibles, abstraction faite du tort causé à leur réputation, ces auteurs sont parvenus, par le passé, à infliger des dommages physiques et financiers à leurs cibles.\n\nLes menaces internes proviennent des personnes qui travaillent dans l’organisation. Elles sont particulièrement dommageables puisque ces personnes ont accès aux réseaux internes qui sont protégés par des périmètres de sécurité. Les menaces internes peuvent être associées à l’un des types d’auteurs de menace mentionnés précédemment et peuvent également inclure des employés mécontents.\n\nCyberoutils commerciaux\n\nLes fournisseurs commerciaux vendent des outils et des services qui permettent aux clients d’installer des maliciels, d’intercepter des communications et de voler de l’information provenant d’appareils ciblés. Les cyberoutils commerciaux sont souvent présentés à titre d’outils destinés aux services de police, mais ce ne sont pas tous les fournisseurs qui font preuve de discernement quant aux acheteurs de leurs produits. Les auteurs de cybermenace peuvent tirer parti des cyberoutils commerciaux pour accroître la sophistication de leurs activités de menace.\n\nHaut de la page \n\n \n\nExposition aux cybermenaces\n\nL’exposition aux cybermenaces fait référence à tous les services et systèmes d’information qu’un auteur de cybermenace peut exploiter en tentant de compromettre une personne, une organisation ou un réseau. Elle comprend tous les terminaux exposés à Internet, y compris les réseaux, les ordinateurs personnels, les appareils mobiles, les dispositifs de l’Internet des objets  (IdO) et les serveurs, en plus des processus qui communiquent avec des systèmes d’information connectés à Internet ou qui dépendent de ceux-ci. L’exposition d’une personne à des menaces repose également sur la quantité de renseignements personnels qui sont partagés avec des services et des fournisseurs en ligne; plus une personne partage ses renseignements personnels et financiers, plus ces renseignements deviennent vulnérables au vol ou à une exposition découlant d’une atteinte à la protection des données. Plus l’exposition aux cybermenaces d’une personne, d’une organisation ou d’un réseau est grande, plus il devient difficile d’assurer sa sécurité.\n\nLe nombre de terminaux connectés à Internet augmente de façon importante chaque année, ce qui s’explique en grande partie par le déploiement de dispositifs qui composent l’IdO et l’Internet industriel des objets (IIoT pour Industrial IoT).Note de bas de page1 Des dispositifs grand public et médicaux connectés, comme les systèmes de sécurité à domicile, les voitures et les stimulateurs cardiaques, sont de plus en plus courants, tout comme les technologies opérationnelles (TO) connectées, qui consistent en du matériel et des logiciels intégrés dans les dispositifs servant à détecter ou à provoquer un changement dans le monde physique.\n\nDes services, des dispositifs et des données peuvent tous être ciblés par des auteurs de cybermenace pour obtenir l’accès initial à un environnement. Les chaînes d’approvisionnement comprennent de plus en plus le transfert de renseignements numériques en plus du transport des marchandises. Depuis 2020, un nombre accru d’organisations ont adopté des technologies comme des logiciels infonuagiques, une infrastructure infonuagique  et des produits de type plateforme-service pour augmenter leur efficacité dans un environnement de travail hybride où certains employés travaillent de la maison alors que d’autres travaillent sur place. Les accords de services gérés comprennent souvent pour les fournisseurs un niveau d’accès élevé aux réseaux de leurs clients. La confiance et le flux d’information entre les organisations procurent aux auteurs de menace les moyens nécessaires pour compromettre les cibles, en compromettant d’abord une tierce partie.\n\n\n\nFigure 2 : Terminaux\n\nUn terminal est un appareil connecté à un réseau, ce qui comprend, entre autres, les ordinateurs personnels, les appareils mobiles, les dispositifs IdO et les serveurs.\n\n\n\nHaut de la page \n\n \n\nCibles, répercussions et activités de cybermenace\n\nCibles des activités de cybermenace\n\n\n\nLes auteurs de cybermenace peuvent mener des activités malveillantes contre tout ce qui peut être connecté à Internet ou s’y trouver, y compris des dispositifs, de l’information, des ressources financières, des opinions et des réputations :\n\nLes dispositifs impliquent des technologies connectées. Il peut s’agir de téléphones cellulaires ou d’ordinateurs, de serveurs et de technologies opérationnelles qui contrôlent les processus industriels. Une fois compromis, ces dispositifs peuvent servir à faciliter des activités de cybermenace.\n\nLe terme information fait référence à la propriété intellectuelle, à d’autres renseignements commerciaux sensibles et à des renseignements personnels. Elle peut également comprendre des renseignements financiers importants comme des détails ou des identifiants bancaires.\n\nLes ressources financières comprennent des actifs tels que des devises numériques et des actifs numériques, notamment la cryptomonnaie. Les auteurs de cybermenace ciblent souvent des Canadiens en ayant recours à la fraude et à des escroqueries visant à convaincre les victimes d’envoyer de l’argent à un auteur de menace pour éviter des sanctions ou pour recevoir une récompense fictive. Les activités de cybermenace visant les institutions financières et les systèmes financiers peuvent être menées dans le but de voler des sommes beaucoup plus importantes.\n\nIl est possible, par des activités d’influence en ligne, d’influencer des opinions et de nuire à la réputation. Ces activités font appel à de la mésinformation, à de la désinformation ou à de la malinformation. Les auteurs de menace peuvent cibler des personnes ou un discours social plus général en influençant des événements précis comme des élections ou en menant des campagnes d’influence constante pour exposer des faits favorables à leurs objectifs géopolitiques.\n\n \n\nHaut de la page \n\nRépercussions des activités de cybermenace\n\nRépercussions sur la vie privée des Canadiens\n\nLes Canadiens mettent considérablement des renseignements personnels sur Internet et dépendent de dispositifs connectés à Internet pour les communications, les finances, le divertissement, le confort et la sécurité. Lorsque ces renseignements se retrouvent en ligne, ils deviennent vulnérables aux actions des auteurs de cybermenace. Ces auteurs volent également des renseignements financiers et médicaux, ainsi que d’autres renseignements personnels qu’ils vendent en ligne ou utilisent dans le cadre de cybercrimes. Les importantes atteintes à la protection des données qui touchent les entreprises ont de graves répercussions sur leurs clients. Ces atteintes révèlent des renseignements personnels pouvant servir à d’éventuels crimes.\n\nRépercussions sur la sécurité financière des Canadiens\n\nLorsque des auteurs de menace obtiennent les identifiants de connexion des Canadiens, les détails relatifs à leurs cartes de crédit et d’autres renseignements personnels, ils se servent de ces renseignements pour voler de l’argent, commettre une fraude ou les vendre sur les marchés de la cybercriminalité. Ces criminels ciblent également les systèmes de point de vente (PDV) utilisés par les entreprises en installant des maliciels afin de voler l’information des clients, de nuire aux activités de l’entreprise, d’effectuer des achats frauduleux, de manipuler les prix et de provoquer d’autres formes de perturbation.\n\nLes Canadiens sont ciblés par des fraudes en ligne. Les auteurs de cybermenace rendent les escroqueries pertinentes et attrayantes en associant leurs cyberfraudes à des événements d’actualité. Les élections, la période des impôts et les nouvelles qui font l’actualité ont toutes servi de toile de fond pour la cybercriminalité.\n\nRépercussions sur la santé économique du Canada\n\nLes activités de cybermenace entraînent des dépenses imprévues pour les organisations, dont des montants attribués à des rançons ou des fonds volés, des pertes en raison de l’interruption des opérations, des coûts nécessaires pour assurer la sécurité des réseaux, l’atteinte à la réputation et la perte de clients qui en découle, et sans oublier le vol de propriété intellectuelle  et de renseignements sensibles.\n\nCes coûts sont un fardeau sur les ressources limitées des organisations et ils diminuent leur compétitivité. Ils sont en fait un fardeau sur l’ensemble de l’économie canadienne.\n\nLes auteurs de cybermenace ciblent les entreprises canadiennes afin de voler de précieux renseignements commerciaux. Le vol de ces renseignements peut entraîner des conséquences financières à court et à long terme pour les victimes, notamment des impacts sur la compétitivité à l’échelle internationale et sur la réputation des victimes.\n\nRépercussions sur la confiance des Canadiens\n\nEn diffusant de l’information trompeuse et potentiellement nuisible, les auteurs de cybermenace polluent l’espace d’information en ligne, ce qui rend difficile pour les Canadiens de séparer la vérité des mensonges. Une telle situation peut influencer le discours civil, les choix des décideurs politiques et avoir une répercussion sur la réputation des politiciens et des dirigeants.\n\nLes auteurs de cybermenace exploitent les relations de confiance entre les organisations en ciblant les systèmes de paiement en ligne et en personne ou les vulnérabilités de la chaîne d’approvisionnement, ou encore en tirant profit de l’accès privilégié que détiennent les fournisseurs de services gérés (les entreprises qui fournissent des services de technologies de l’information [TI] et qui assurent la maintenance des réseaux de leurs clients.)\n\nRépercussions sur la sécurité des Canadiens\n\nLorsque les auteurs de cybermenace ciblent des processus physiques d’une industrie ou des services essentiels connectés à Internet, comme ceux que l’on retrouve dans les secteurs des soins de santé et des transports, des perturbations peuvent provoquer des répercussions sur la sécurité des Canadiens. Pour ce qui est des particuliers, les activités de cybermenace visant des dispositifs IdO domestiques et personnels, y compris des dispositifs médicaux comme des stimulateurs cardiaques, risquent d’avoir des répercussions sur la sécurité physique.\n\nDes harceleurs et des partenaires violents peuvent tirer avantage des vulnérabilités des dispositifs IdO personnels pour voler les renseignements recueillis par les moniteurs d’activité physique et les technologies intelligentes dans une maison afin d’identifier et de localiser les victimes ou de contrôler ouvertement leurs dispositifs dans le but de les intimider.\n\n\n\n \n\nHaut de la page \n\nFaçon de procéder des auteurs de cybermenace\n\nLes auteurs de cybermenace poursuivent leurs objectifs en exploitant les vulnérabilités techniques, en ayant recours au piratage psychologique , et en créant, en diffusant ou en amplifiant un contenu en ligne erroné ou trompeur pour influencer le comportement et les croyances de certaines personnes.\n\nL’exploitation de vulnérabilités consiste à profiter des lacunes ou des défauts dans la conception, la mise en œuvre, l’exploitation ou la gestion d’un système TI, d’un dispositif ou d’un service, collectivement appelées les vulnérabilités. Les auteurs de menace utilisent des exploits pour tirer parti des vulnérabilités et déployer des charges de virus  qui leur permettent d’accéder à une activité malveillante sur le système d’une victime, de la contrôler, de la détruire ou de l’utiliser pour faciliter d’autres activités malveillantes. Ils peuvent avoir recours à des outils qui exploitent directement des vulnérabilités techniques précises, tandis que les auteurs dotés de moyens sophistiqués peuvent investir dans des ressources pouvant les aider à découvrir de nouvelles vulnérabilités, jusqu’à présent inconnues; c’est ce que l’on appelle le jour zéro , dans les systèmes cibles. Alors que les vulnérabilités du jour zéro ne sont pas connues des propriétaires de systèmes TI ou de logiciels, les auteurs de cybermenace ciblent également des vulnérabilités connues, tirant ainsi avantage des protocoles de sécurité faibles et des systèmes non corrigés.\n\nLe piratage psychologique consiste à exploiter la confiance des gens qui utilisent les TI. Cette exploitation se fait en se basant sur des caractéristiques propres aux humains comme l’insouciance et la confiance. Les auteurs de menace ont recours au piratage psychologique pour inciter des gens à communiquer de l’information sensible ou à autoriser accidentellement l’accès à un système, à un réseau ou à un dispositif. Le piratage psychologique est aujourd’hui une tactique très répandue dans le cadre des activités de cybermenace. La compromission  de courriel d’affaires (BEC pour Business Email Compromise), ou fraude du faux PDG, est l’une des fraudes liées au piratage psychologique les plus courantes et coûteuses. Lors d’une telle fraude, les auteurs de menace se font passer pour des cadres supérieurs ou des tiers de confiance pour inciter les victimes à transférer directement des fonds. Le piratage psychologique est aussi souvent utilisé conjointement avec l’exploitation de vulnérabilités. Par exemple, les auteurs de menace créent des courriels d’hameçonnage  et de harponnage  contenant des liens ou des fichiers malveillants. Lorsque les victimes cliquent sur ces liens ou fichiers, des exploits sont activés qui permettent à l’auteur de menace d’accéder au système de la victime.\n\nLes auteurs de cybermenace étrangers peuvent également manipuler les médias sociaux, la publicité légitime et les outils d’échange d’information pour mener des campagnes d’influence étrangère en ligne en vue d’affecter de façon générale des événements à l’échelle nationale comme des élections, un recensement ou des campagnes de santé publique, ainsi que des débats publics. L’influence étrangère en ligne se produit lorsque des auteurs de cybermenace étrangers parviennent secrètement à créer, à diffuser ou à amplifier la mésinformation, la désinformation ou la malinformation pour influencer les croyances ou les comportements de citoyens d’un autre pays. Ils tirent avantage de leur compréhension du fonctionnement des médias traditionnels et des médias sociaux – et de la façon dont les personnes consomment l’information – pour diffuser leur message à un vaste auditoire, et à un coût relativement bas. Ils peuvent y parvenir en se faisant passer pour des fournisseurs d’information légitimes, en piratant des comptes dans les médias sociaux ou en créant des sites Web et de nouveaux comptes. Les auteurs de menace peuvent également tirer parti de la technologie pour créer un contenu synthétique comportant du texte, des images ou des vidéos et ainsi promouvoir leurs messages ou provoquer des perturbations.\n\nIdentification des activités de cybermenace\n\n\n\nPar attribution, on entend l’action de déterminer avec précision qui est l’auteur de menace responsable d’un ensemble particulier d’activités. L’attribution d’une activité à un auteur de cybermenace est importante pour plusieurs raisons, notamment pour assurer la défense d’un réseau, appliquer la loi, prendre des mesures dissuasives et préserver des relations extérieures. Or, cette attribution peut s’avérer difficile puisque de nombreux auteurs de cybermenace ont recours à l’obscurcissement pour éviter que des activités ne leur soient attribuées.\n\nPar obscurcissement, on entend les outils et les moyens que les auteurs de menace utilisent pour dissimuler leur identité, leurs objectifs, leurs techniques et même leurs victimes. Pour éviter de laisser aux responsables de la sécurité des indices susceptibles de les aider à attribuer l’activité, les auteurs de menace emploient des outils et des techniques facilement accessibles ou des outils qui permettent de transmettre secrètement l’information sur Internet.\n\nLes auteurs de menace sophistiqués peuvent également mener des opérations sous faux pavillon. Cette technique consiste à imiter les activités connues d’autres auteurs de menace dans l’espoir que les responsables de la sécurité attribuent faussement l’activité à quelqu’un d’autre. Par exemple, un État-nation pourrait employer un outil utilisé par des cybercriminels ou par d’autres États-nations dans l’espoir qu’une activité leur soit attribuée.\n\nLa capacité des auteurs de cybermenace de dissimuler leurs actions dépend du degré de sophistication de leurs méthodes et de leur motivation. En règle générale, les États-nations et les cybercriminels compétents arrivent plus habilement à pratiquer l’obscurcissement que d’autres auteurs de cybermenace.\n\nHaut de la page \n\n \n\nAnnexe : Glossaire\n\nVous trouverez ci-dessous une liste non exhaustive des outils et des techniques couramment utilisés par les auteurs de menace. Par souci de simplicité, les éléments sont affichés par ordre alphabétique et non en fonction de leur fréquence ou de leur incidence.\n\nActivité d’influence étrangère en ligne\n\nUne activité d’influence étrangère en ligne est un instrument courant qui permet à des adversaires de poursuivre leurs principaux intérêts, notamment la sécurité nationale, la prospérité économique et des objectifs idéologiques. Les campagnes d’influence en ligne peuvent tenter d’avoir un impact sur le discours civil, d’influencer les choix des décideurs politiques, d’aggraver la friction dans les sociétés démocratiques ou de nuire à la réputation de personnalités publiques comme les politiciens. Les activités d’influence étrangère en ligne exploitent souvent la mésinformation, la désinformation et la malinformation.\n\nMésinformation\n\nLa mésinformation désigne le fait de diffuser intentionnellement une fausse information sans avoir de mauvaises intentions.\n\nDésinformation\n\nPar désinformation, on entend le fait de diffuser intentionnellement une fausse information dans le but de manipuler ou de tromper des personnes, des organisations et des États ou bien de leur faire du tort.\n\nMalinformation\n\nLa malinformation désigne le fait de diffuser de l’information qui repose sur un fait, mais qui est souvent exagérée de façon à tromper ou même à causer des préjudices.\n\n\n\nAttaque de l’intercepteur\n\nL’attaque de l’intercepteur est une technique qui consiste à intercepter les communications entre deux parties, comme un utilisateur et un serveur Web, à l’insu de la victime. Celle-ci croit avoir établi une connexion directe et sécurisée avec un site Web. L’attaque de l’intercepteur permet aux auteurs de menace de surveiller les communications, de réacheminer le trafic, de modifier l’information, d’installer des maliciels et d’obtenir des renseignements nominatifs ou de l’information sensible. Elle peut être réalisée au moyen de diverses techniques : l’hameçonnage, le détournement de domaine, le typosquattage, l’écoute électronique par réseau Wi-Fi et le détournement SSL.\n\nFigure 3 : Attaque de l'intercepteur\n\nDescription détaillée - Attaque de l'intercepteur\n\n \n\nHaut de la page \n\nDétournement SSL\n\nLe détournement SSL (Secure Sockets Layer) est une technique par laquelle un auteur de menace intercepte et redirige une connexion non sécurisée entre une victime et un serveur tentant d’établir une connexion sécurisée. La connexion sécurisée est alors fournie par l’auteur de menace plutôt que par le site Web prévu, ce qui lui permet d’intercepter et de compromettre les communications à l’insu de la victime (voir « attaque de l’intercepteur »). Le détournement SSL n’a pas pour objet de porter atteinte à la sécurité fournie par le protocole SSL, mais bien de compromettre la connexion entre les parties non chiffrée et chiffrée de la communication.\n\nÉcoute électronique par réseau Wi-Fi\n\nUn auteur de menace utilise l’écoute électronique par réseau Wi-Fi pour installer ce qui semble être un point d’accès Wi-Fi légitime dans une zone publique. Les utilisateurs qui se connectent à un tel point d’accès, que l’on appelle souvent un point d’accès malveillant ou indésirable, peuvent alors être victimes d’une attaque de l’intercepteur. Par ailleurs, les auteurs de menace peuvent être en mesure d’intercepter du trafic Web non chiffré sur des réseaux Wi-Fi publics non sécurisés. Une telle activité permet à un auteur de menace de surveiller les communications et d’obtenir des renseignements nominatifs ou de l’information sensible.\n\n\n\nAttaque hors sol\n\nUne attaque hors sol se produit lorsqu’un auteur de menace utilise uniquement les outils disponibles par les processus légitimes des systèmes de la victime pour mener à bien une cyberactivité malveillante, plutôt que de déployer un maliciel . Les auteurs de cybermenace se servent d’outils préexistants dans un système pour se fondre dans les opérations normales d’un dispositif ou du réseau de la victime et ainsi éviter d’être détectés.\n\n\n\nCassage de mot de passe\n\nLe cassage de mot de passe fait référence à des techniques qui permettent aux auteurs de cybermenace d’avoir un accès direct à un compte en devinant ou en déchiffrant le mot de passe.\n\nForce brute\n\nUne attaque par force brute consiste à utiliser un nombre exhaustif de mots de passe générés aléatoirement pour tenter de deviner le bon mot de passe et d’accéder au compte. Le cassage de mot de passe par force brute est la méthode la moins efficace, particulièrement dans le cas des mots de passe complexes.\n\nBourrage d’identifiants\n\nUne attaque par bourrage d’identifiants est une manœuvre consistant à utiliser des listes de combinaisons de noms d’utilisateur et de mots de passe compromis afin d’accéder frauduleusement à des comptes en ligne. Les auteurs de cybermenace ont recours à ces listes pour lancer des demandes de connexion automatisées à grande échelle dans l’espoir que l’une des combinaisons corresponde à un compte existant auquel ils pourront avoir accès.\n\nAttaque par dictionnaire\n\nLes attaques par dictionnaire mettent à profit des listes exhaustives de mots et de mots de passe fréquemment utilisés, qui comprennent souvent des fautes d’orthographe et diverses permutations qui tiennent compte des exigences en matière de complexité des mots de passe.\n\n\n\nDéni de service\n\nUn déni de service (DoS pour Denial of Service) désigne une activité visant à rendre un service (p. ex. un site Web, un serveur, un réseau, un dispositif IdO) inutilisable ou à ralentir l’exploitation et les fonctions d’un système.\n\nAttaque par inondation\n\nUne attaque par inondation est la forme la plus courante de déni de service. Elle se produit lorsqu’un auteur de menace envoie à répétition des demandes de connexion au serveur ciblé, mais qu’il ne parvient pas à établir la connexion. Ces procédures de connexion incomplètes occupent et consomment toutes les ressources disponibles du serveur. Ainsi, le serveur ne parvient plus à traiter ni le trafic ni les demandes de connexion légitimes.\n\n\n\nAttaque par arrêt de service\n\nLes attaques par arrêt de service sont moins répandues que les attaques par inondation. Les auteurs de menace s’en servent pour exploiter une vulnérabilité  dans le but de provoquer une panne de système pour ainsi en empêcher l’accès.\n\nDéni de service distribué\n\nUne attaque par déni de service distribué (DDoS pour Distributed Denial of Service) est une attaque par déni de service  qui provient de plusieurs machines à la fois. Ces machines peuvent être contrôlées par un groupe d’auteurs de menace travaillant ensemble ou faire partie d’un réseau de zombies agissant sous le contrôle d’un seul auteur de menace. Les DDoS  sont plus puissants, ce qui complique davantage la tâche d’identification de la véritable source de l’attaque.\n\nFigure 4 : Déni de service distribué\n\nDescription détaillée - Déni de service distribué\n\n\n\n \n\nHaut de la page \n\nExploit et trousse d’exploit\n\nUn exploit est un code malveillant qui tire avantage d’une vulnérabilité non corrigée. Une trousse d’exploit est une collection d’exploits qui ciblent les applications logicielles non sécurisées. Les trousses d’exploit sont adaptées de manière à chercher des vulnérabilités précises et à exécuter l’exploit correspondant à la vulnérabilité relevée. Si un utilisateur visite un site Web hébergeant une trousse d’exploit, celle-ci comparera son référentiel d’exploits aux applications logicielles qui se trouvent sur le dispositif de l’utilisateur et déploiera l’exploit correspondant à la vulnérabilité décelée.\n\nInjection de code\n\nL’injection de code est une technique qui consiste à insérer du code malveillant dans un programme informatique en exploitant une faille dans les instructions d’une fonction du programme ou dans la façon dont ce programme interprète les données saisies. Les deux techniques d’injection de code  souvent utilisées sont l’injection de script intersites (XSS pour Cross-Site Scripting) et l’injection SQL (Structured Query Language).\n\nL’injection XSS est une méthode d’injection de code au moyen de laquelle un auteur de menace insère et exécute un programme malveillant dans une application Web en contournant les mécanismes de validation des données saisies. Le programme malveillant est exécuté dans le navigateur des utilisateurs qui accèdent à l’application Web infectée. Le code injecté par XSS peut être une exécution unique ou être utilisé pour permettre une activité malveillante ultérieure.\n\nL’injection SQL récupère ou modifie le contenu d’une base de données SQL en insérant du code dans des formulaires Web destinés à saisir des données dans les bases de données SQL ou à les interroger. Ces bases de données peuvent contenir des renseignements nominatifs ou de l’information sensible.\n\nExploitation du jour zéro\n\nUne vulnérabilité du jour zéro est une vulnérabilité dont l’existence est inconnue du fournisseur, ce qui signifie que son risque n’a pas été atténué par un correctif. Un exploit du jour zéro est une attaque dirigée vers une vulnérabilité du jour zéro. Lorsqu’un correctif a été mis au point, la vulnérabilité n’est plus considérée comme étant du jour zéro.\n\n\n\nExploit sur le Web\n\n\n\nLes exploits sur le Web visent à compromettre les utilisateurs lorsqu’ils naviguent, ou tentent de naviguer, sur des pages Web précises. Ces exploits fonctionnent en compromettant ou en se faisant passer pour un site Web que les victimes cherchent à visiter. Ce faisant, les victimes subissent elles-mêmes une compromission, ou il y a une exploitation des vulnérabilités du système qui dirigent les utilisateurs à la bonne page Web.\n\nAttaque par téléchargement furtif\n\nPar attaque par téléchargement furtif, on entend le code malveillant qu’un auteur de cybermenace installe sur un site Web à l’insu de l’hôte dans le but de compromettre les dispositifs des utilisateurs qui le consultent.\n\nDétournement de formulaire\n\nLe détournement de formulaire consiste à injecter du code malveillant dans un formulaire de page Web, comme une page de paiement, pour le compromettre et voler les détails relatifs aux cartes de crédit ainsi que d’autres renseignements que les utilisateurs entrent sur ces pages.\n\nDétournement de domaine\n\nLe détournement de domaine est une technique qui consiste à rediriger le trafic d’un site Web légitime vers un site malveillant. Pour réaliser cette supercherie, les auteurs de menace modifient les paramètres système de l’utilisateur ou exploitent les vulnérabilités logicielles du serveur du système d’adressage par domaines (DNS pour Domain Name System ) qui assure la correspondance entre les adresses URL et les adresses IP. Contrairement au typosquattage (voir ci-dessous), une technique qui tire avantage des fautes de frappe de l’utilisateur pour le rediriger vers un site Web illégitime, le détournement de domaine peut rediriger l’utilisateur malgré le fait qu’il ait tapé la bonne adresse URL. Au premier coup d’œil, le site Web illégitime peut sembler légitime, alors qu’il sert en réalité à installer un maliciel et à obtenir des renseignements nominatifs ou de l’information sensible.\n\nTyposquattage\n\nLe typosquattage est une technique qui consiste à enregistrer des noms de domaines graphiquement apparentés à une adresse de domaine légitime, mais pouvant facilement être confondus. Cette technique, appelée également détournement d’adresse URL, elle permet aux auteurs de menace de rediriger un utilisateur ayant fait une erreur au moment de saisir l’adresse d’un site Web vers un domaine en apparence similaire sous leur contrôle. Le nouveau domaine peut alors servir à installer un maliciel et à obtenir des renseignements nominatifs ou de l’information sensible. Des techniques d’hameçonnage peuvent également être utilisées pour attirer les utilisateurs vers une adresse URL détournée.\n\nAttaque par embuscade\n\nUne attaque par embuscade consiste à compromettre au moyen d’un exploit un site Web consulté fréquemment par des personnes précises en vue de les infecter.\n\n \n\nHaut de la page \n\nMaliciel\n\nUn maliciel (abréviation des mots « malveillant » et « logiciel ») désigne tout logiciel ou code conçu pour infiltrer ou endommager un système informatique. Le terme « charge de virus » fait référence aux actions réalisées par un logiciel malveillant lorsqu’il se trouve dans un système ou dans le réseau d’une victime (p. ex. un rançongiciel  qui chiffre des fichiers ou l’installation de portes dérobées qui permettent un accès à distance).\n\nPubliciel\n\nUn publiciel (abréviation des mots « publicitaire » et « logiciel ») peut infecter un ordinateur lorsqu’il est téléchargé dans le cadre du téléchargement d’un autre programme ou d’une attaque par téléchargement furtif sur le Web. Son objectif principal est de générer des revenus en offrant de la publicité en ligne adaptée. Un logiciel publicitaire basé sur un navigateur et sur une application fait le suivi et la collecte de l’information liée aux utilisateurs et aux dispositifs, dont les données de localisation. Les publiciels peuvent mener à l’exploitation des paramètres de sécurité, des utilisateurs et des systèmes.\n\nBalise\n\nLes balises sont des signaux envoyés par un maliciel. Elles tentent de se connecter à l’infrastructure de commande d’un auteur de menace après s’être infiltrées dans l’environnement ciblé. Les balises avisent l’auteur de menace qu’il a réussi à compromettre le système et lui permettent d’envoyer des commandes supplémentaires au maliciel.\n\nMinage clandestin\n\nLe minage clandestin permet à un auteur de menace d’exploiter secrètement le dispositif d’une victime (p. ex. un ordinateur, un appareil mobile ou un dispositif IdO) dans le but de miner de la cryptomonnaie sans autorisation . Pour accroître son efficacité (c'est-à-dire. ses revenus), l’auteur de menace peut faire appel à un réseau de zombies composé de dispositifs compromis. Les logiciels malveillants utilisés à cette fin sont généralement téléchargés lors de la consultation d’un site Web compromis, à l’installation d’une application ou par hameçonnage. Par cryptominage ou minage de cryptomonnaie, on entend le processus par lequel des programmes informatiques utilisent la puissance de calcul d’ordinateurs pour générer ou « miner » de la cryptomonnaie, activité pour laquelle le mineur reçoit, pour ses services, une fraction de la cryptomonnaie minée.\n\nRançongiciel\n\nUn rançongiciel est un programme malveillant qui permet de bloquer l’accès à un ordinateur ou à un dispositif et à son fonctionnement; l’accès au système n’est rendu qu’après le versement d’une rançon. Les auteurs de menace accomplissent cet acte au moyen du chiffrement , mais ils peuvent également avoir recours à diverses méthodes d’extorsion, comme le fait de déployer des attaques DDoS, de menacer des partenaires et des clients ou de menacer de publier des renseignements de nature sensible. Un rançongiciel est généralement installé au moyen d’un cheval de Troie  ou d’un ver  déployé par hameçonnage ou à la consultation d’un site Web compromis.\n\nCertains cybercriminels se livrent à des campagnes de rançongiciel de type chasse au gros gibier. Ils concentrent ainsi leurs activités sur de grandes organisations comme des fournisseurs d’infrastructures essentielles, des gouvernements ou des grandes entreprises, qui doivent éviter que leurs réseaux soient perturbés et qui sont prêts à payer de lourdes rançons pour rétablir rapidement leurs opérations.\n\nDissimulateur d’activité\n\nUn dissimulateur d’activité est une application malveillante conçue pour fournir à un auteur de menace un accès racine ou administrateur privilégié aux logiciels et aux systèmes qui se trouvent sur le dispositif d’un utilisateur. Un dissimulateur d’activité fournit un accès complet, y compris la capacité de modifier les logiciels utilisés pour détecter les maliciels.\n\nEspiogiciel\n\nLes espiogiciels (abréviation des mots « espion » et « logiciel ») sont des logiciels malveillants utilisés pour recueillir et transmettre les activités numériques et les données personnelles de l’utilisateur à son insu et sans sa permission. Ils peuvent être utilisés dans le cadre de plusieurs activités, notamment l’enregistrement de la frappe, l’accès au microphone et à la caméra Web, la surveillance des activités de l’utilisateur et de ses habitudes de navigation, et la capture des noms d’utilisateurs et des mots de passe. Un espiogiciel qui est utilisé pour faciliter la violence, les abus ou le harcèlement de partenaires intimes est appelé logiciel traqueur.\n\nCheval de Troie\n\n\n\nUn cheval de Troie est un programme malveillant déguisé en logiciel légitime ou qui y est intégré.\n\nVirus\n\nUn virus est un programme exécutable et reproductible qui insère son propre code dans des programmes légitimes dans le but de causer des dommages sur l’ordinateur hôte (p. ex. en supprimant des fichiers et des programmes ou en corrompant les systèmes d’exploitation et de stockage).\n\nEffaceur\n\nLes effaceurs sont des maliciels conçus pour détruire entièrement le disque dur des dispositifs infectés. Les effaceurs peuvent se faire passer pour un rançongiciel en vue de dissimuler l’intention du maliciel et de rendre l’attribution encore plus difficile.\n\nVer\n\nUn ver est un programme informatique capable de se reproduire indépendamment par lui-même et de se propager sur d’autres ordinateurs afin de drainer les ressources du système. Tout comme un virus, un ver peut propager un code pouvant endommager son hôte (p. ex. supprimer des fichiers, envoyer des documents par courriel ou saturer la bande passante).\n\n\n\n \n\nHaut de la page \n\nOrdinateur zombie et réseau de zombies\n\nUn ordinateur zombie, ou zombie, est un dispositif connecté à Internet (p. ex. un ordinateur, un appareil mobile ou un dispositif IdO) et infecté par un maliciel à l’insu du propriétaire, qu’un auteur de menace peut contrôler à distance afin de mener des opérations illicites. Ensemble, ces dispositifs compromis forment un réseau de zombies coordonné par un auteur de menace. Les réseaux de zombies se répandent généralement en sondant l’environnement en ligne dans le but de trouver des dispositifs vulnérables susceptibles d’accroître la puissance informatique et d’ajouter de nouvelles capacités. Ils servent à des fins diverses, telles que pour mener une attaque par déni de service distribué  (DDoS pour Distributed Denial of Service), propager des rançongiciels et des maliciels, lancer des campagnes publicitaires frauduleuses, envoyer des pourriels, détourner le trafic, voler des données, ou encore pour manipuler, enflammer et censurer les médias sociaux et le contenu de plateformes Web de manière à influencer les débats publics.\n\n\n\nPiratage psychologique\n\nLe piratage psychologique est une pratique qui permet d’obtenir de l’information sensible en manipulant des utilisateurs légitimes, souvent par téléphone ou Internet. Les techniques de piratage psychologique visent à convaincre la cible d’envoyer un paiement dans un compte contrôlé par l’auteur de menace ou de recueillir de l’information pour entreprendre d’autres activités de menace.\n\nHameçonnage\n\nL’hameçonnage est une technique courante par laquelle les auteurs de menace se font passer pour une entité fiable dans le but d’inciter un grand nombre de destinataires à fournir de l’information les concernant, comme des justificatifs d’ouverture de session, de l’information bancaire et d’autres renseignements nominatifs. L’hameçonnage est une technique de piratage psychologique qui consiste essentiellement à usurper des courriels et des messages textes. Les utilisateurs tombent dans le piège dès qu’ils ouvrent des pièces jointes malveillantes ou cliquent sur les liens intégrés.\n\nMystification\n\nLa mystification est une technique utilisée pour dissimuler ou falsifier un site Web, une adresse courriel ou un numéro de téléphone de manière à ce qu’il semble provenir d’une source fiable. Après avoir reçu un message d’hameçonnage, la victime peut être invitée à fournir de l’information personnelle, financière ou sensible, ou à cliquer sur un lien ou une pièce jointe, ce qui permettra d’infecter le dispositif en y installant un maliciel.\n\nHarponnage\n\nLe harponnage est une technique qui consiste à envoyer un message d’hameçonnage personnalisé à un groupe précis de destinataires ou à un seul destinataire. Basée sur le piratage psychologique, cette technique utilise des détails destinés à convaincre la victime que le message provient d’une source digne de confiance. La chasse à la baleine est un type de harponnage qui vise les cadres supérieurs et les autres destinataires de grande notoriété disposant d’autorisations et d’accès privilégiés.\n\nCompromission de courriel d’affaires\n\nLa compromission de courriel d’affaires, ou fraude du faux PDG, est l’une des fraudes liées au piratage psychologique les plus courantes et coûteuses qui cible les organisations. Elle implique des courriels conçus pour convaincre un employé d’une entreprise ciblée de transférer directement des fonds aux auteurs de cybermenace. Pour ce faire, les auteurs se font passer pour des cadres supérieurs ou des tiers de confiance.\n\nFigure 5 : Hameçonnage et harponnage\n\nDescription détaillée - Hameçonnage et harponnage\n\nPorte dérobée\n\nUne porte dérobée  est un point d’entrée dans le système ou l’ordinateur d’un utilisateur, qui permet de contourner contrôles d’accès et mesures d’authentification  habituels. Les auteurs de menace qui disposent d’un tel accès à distance peuvent voler l’information, installer des maliciels ou contrôler les processus et procédures du dispositif. Les portes dérobées peuvent être le résultat d’un maliciel ou d’une autre cyberactivité malveillante, mais elles sont aussi souvent créées délibérément et sans intention de nuire, aux fins de dépannage, de mise à jour logicielle ou de maintenance système. Les auteurs de menace peuvent utiliser ces portes dérobées légitimes à des fins malveillantes.\n\n\n\nReconnaissance\n\nReconnaissance, ou recon, désigne les activités menées par un auteur de menace pour lui permettre d’obtenir des renseignements et d’identifier des vulnérabilités dans le but de faciliter d’éventuelles compromissions. Les auteurs de menace opportunistes peuvent scruter Internet à la recherche d’hôtes ayant des vulnérabilités non sécurisées et les cibler. Lorsqu’une cible est sélectionnée, l’auteur peut mener des recherches supplémentaires sur celle-ci, dont des recherches de source ouverte sur l’entreprise, les employés ou l’infrastructure. Parmi les techniques plus directes, notons l’accès à la cible au moyen de trafic Internet malveillant ou en utilisant le piratage psychologique pour soutirer des renseignements."}}, "./files\\Land Surface and Vegetation-EN\\Land Surface and Vegetation-EN.docx": {"EN": {"filename": "Land Surface and Vegetation-EN.docx", "path": "", "text": "Land Surface and Vegetation\n\nCanada’s northern land surface is under transformation, much of it driven by changing climate conditions and an increased interest in this region’s natural resources.  Understanding this change in a historical context and projecting it into the future is central to the proper stewardship of this unique environment and the responsible development of its vast resources.\n\nPrevious land cover maps covering northern Canada have been of insufficient spatial or thematic detail to address emerging northern issues such as wildlife habitat, land use planning, and fine-scale land cover dynamics.  Satellite remote sensing is the only method capable of systematically monitoring Canada’s northern landscape to provide information with the appropriate level of detail at the frequency required.\n\nCanada’s north presents some significant challenges to satellite observation – cloud-cover, polar darkness, large sun angles.  Canada Centre for Mapping and Earth Observation research has focused on developing and validating satellite-based techniques capable of reliably mapping northern:\n\nLand cover – the location, distribution and volume/density of land cover (vegetation, urban, water)\n\nBiophysical Parameters – the quantitative, spatially and temporally explicit, descriptions of land surface conditions"}, "FR": {"filename": "Land Surface and Vegetation-FR.docx", "path": "", "text": "Surface terrestre et végétation\n\nLa surface terrestre du Nord canadien est en pleine mutation, principalement en raison des changements climatiques et de l’intérêt accru que l’on porte aux ressources naturelles de la région. La compréhension de la situation d’un point de vue historique et des projections dans le futur sont essentielles à l’intendance appropriée de cet environnement unique et au développement responsable de ses innombrables ressources.\n\nLes cartes antérieures de la couverture des terres ne présentent pas suffisamment de détails sur le plan spatial ou thématique pour que l’on puisse aborder adéquatement les enjeux nordiques émergents, comme les habitats fauniques, la planification de l’utilisation du sol et la dynamique de la couverture des sols à petite échelle. La télédétection par satellite constitue la seule méthode de surveillance systématique du paysage nordique canadien capable d’offrir le niveau de détail approprié à la fréquence requise.\n\nLe Nord du Canada pose d’importants défis pour l’observation satellitaire – couverture nuageuse, nuit polaire, grands angles solaires. La recherche effectuée au Centre canadien de cartographie et d’observation de la Terre a porté sur l’élaboration et la validation de techniques satellitaires en vue de la cartographie fiable du Nord :\n\nCouverture des terres – emplacement, répartition et volume/densité (végétation, centres urbains, eau);\n\nParamètres biophysiques – descriptions explicites, sur le plan quantitatif, spatial et temporel, des conditions de la surface terrestre."}}}